ryakosh/lwesp_stm32f103c8_port/lwesp_ll_stm32f103c8.h
/*
 * Default UART configuration is:
 *
 * UART:                USART1
 * STM32 TX (ESP RX):   GPIOA, GPIO_PIN_9
 * STM32 RX (ESP TX):   GPIOA, GPIO_PIN_10
 * RESET:               GPIOB, GPIO_PIN_3
 * GPIO0:               GPIOA, GPIO_PIN_0
 * GPIO2:               GPIOA, GPIO_PIN_3
 * CH_PD:               GPIOA, GPIO_PIN_4
 *
 * USART_DMA:           DMA1
 * USART_DMA_CHANNEL:   DMA_CHANNEL_5
 */

#ifndef LWESP_STM32F103C8_H
#define LWESP_STM32F103C8_H

#include "stm32f1xx_ll_bus.h"
#include "stm32f1xx_ll_usart.h"
#include "stm32f1xx_ll_gpio.h"
#include "stm32f1xx_ll_dma.h"
#include "stm32f1xx_ll_rcc.h"
#include "stm32f1xx_ll_pwr.h"

/* USART */
#define LWESP_USART                           USART1
#define LWESP_USART_CLK                       LL_APB2_GRP1_EnableClock(LL_APB2_GRP1_PERIPH_USART1)
#define LWESP_USART_IRQ                       USART1_IRQn
#define LWESP_USART_IRQHANDLER                USART1_IRQHandler

/* DMA settings */
#define LWESP_USART_DMA                       DMA1
#define LWESP_USART_DMA_CLK                   LL_AHB1_GRP1_EnableClock(LL_AHB1_GRP1_PERIPH_DMA1)
#define LWESP_USART_DMA_RX_CH                 LL_DMA_CHANNEL_5
#define LWESP_USART_DMA_RX_IRQ                DMA1_Channel5_IRQn
#define LWESP_USART_DMA_RX_IRQHANDLER         DMA1_Channel5_IRQHandler

/* DMA flags management */
#define LWESP_USART_DMA_RX_IS_TC              LL_DMA_IsActiveFlag_TC5(LWESP_USART_DMA)
#define LWESP_USART_DMA_RX_IS_HT              LL_DMA_IsActiveFlag_HT5(LWESP_USART_DMA)
#define LWESP_USART_DMA_RX_CLEAR_TC           LL_DMA_ClearFlag_TC5(LWESP_USART_DMA)
#define LWESP_USART_DMA_RX_CLEAR_HT           LL_DMA_ClearFlag_HT5(LWESP_USART_DMA)

/* USART TX PIN */
#define LWESP_USART_TX_PORT_CLK               LL_APB2_GRP1_EnableClock(LL_APB2_GRP1_PERIPH_GPIOA)
#define LWESP_USART_TX_PORT                   GPIOA
#define LWESP_USART_TX_PIN                    LL_GPIO_PIN_9

/* USART RX PIN */
#define LWESP_USART_RX_PORT_CLK               LL_APB2_GRP1_EnableClock(LL_APB2_GRP1_PERIPH_GPIOA)
#define LWESP_USART_RX_PORT                   GPIOA
#define LWESP_USART_RX_PIN                    LL_GPIO_PIN_10

/* RESET PIN */
//#define LWESP_RESET_PORT_CLK                  LL_APB2_GRP1_EnableClock(LL_APB2_GRP1_PERIPH_GPIOB)
//#define LWESP_RESET_PORT                      GPIOB
//#define LWESP_RESET_PIN                       LL_GPIO_PIN_3

/* GPIO0 PIN */
//#define LWESP_GPIO0_PORT_CLK                  LL_APB2_GRP1_EnableClock(LL_APB2_GRP1_PERIPH_GPIOA)
//#define LWESP_GPIO0_PORT                      GPIOA
//#define LWESP_GPIO0_PIN                       LL_GPIO_PIN_0

/* GPIO2 PIN */
//#define LWESP_GPIO2_PORT_CLK                  LL_APB2_GRP1_EnableClock(LL_APB2_GRP1_PERIPH_GPIOA)
//#define LWESP_GPIO2_PORT                      GPIOA
//#define LWESP_GPIO2_PIN                       LL_GPIO_PIN_3

/* CH_PD PIN */
//#define LWESP_CH_PD_PORT_CLK                  LL_APB2_GRP1_EnableClock(LL_APB2_GRP1_PERIPH_GPIOA)
//#define LWESP_CH_PD_PORT                      GPIOA
//#define LWESP_CH_PD_PIN                       LL_GPIO_PIN_4

#endif /* LWESP_STM32F103C8_H */
